timeline.org
#+options: toc:nil

# Example URL: https://tex.stackexchange.com/questions/63877/gantt-chart-package

#+latex_header:\usepackage{pgfgantt}
#+latex_header:\usepackage{geometry}
#+latex_header:\usepackage{subcaption}
#+latex_header:\geometry{landscape, margin=0.5in}

#+begin_src latex
  \begin{figure}[tbp]
  \centering
  \begin{subfigure}[t]{0.9\paperwidth} \centering

      \begin{ganttchart}[y unit title=0.4cm,
          y unit chart=0.5cm,
          vgrid,hgrid,
          title label anchor/.style={below=-1.6ex},
          title left shift=.05,
          title right shift=-.05,
          title height=1,
          progress label text={},
          bar height=0.7,
          group right shift=0,
          group top shift=.6,
          group height=.3]{1}{29}
        %labels
        \gantttitle{February}{29}\\
        \gantttitle{Week 1}{3}
        \gantttitle{W2}{7}
        \gantttitle{W3}{7}
        \gantttitle{W4}{7}
        \gantttitle{W5}{5} \\

        %tasks
        \ganttbar[progress=95]{MILP PAP Paper}{25}{29} \\
        \ganttbar[progress=95]{SA-PAP Data}{25}{29} \\

      \end{ganttchart}
  \end{subfigure}

  \begin{subfigure}[t]{0.9\paperwidth} \centering

      \begin{ganttchart}[y unit title=0.4cm,
          y unit chart=0.5cm,
          vgrid,hgrid,
          title label anchor/.style={below=-1.6ex},
          title left shift=.05,
          title right shift=-.05,
          title height=1,
          progress label text={},
          bar height=0.7,
          group right shift=0,
          group top shift=.6,
          group height=.3]{1}{31}
        %labels
        \gantttitle{March}{31} \\
        \gantttitle{W1}{2}
        \gantttitle{W2}{7}
        \gantttitle{W3}{7}
        \gantttitle{W4}{7}
        \gantttitle{W5}{7}
        \gantttitle{W6}{1} \\

        %tasks
        \ganttbar[progress=95]{SA-PAP Data}{1}{2} \\
        \ganttbar[progress=85]{SA PAP Paper}{3}{9} \\
        \ganttbar[progress=0]{Submit SA PAP Paper}{9}{23} \\
        \ganttbar[progress=25]{Write Thesis}{9}{31} \\
        \ganttbar[progress=0]{Submit Thesis}{20}{31} \\

        %relations
        \ganttlink{elem0}{elem1}
        \ganttlink{elem1}{elem2}
        \ganttlink{elem1}{elem3}
        \ganttlink{elem3}{elem4}
      \end{ganttchart}
  \end{subfigure}

  \begin{subfigure}[t]{0.75\paperwidth} \centering

      \begin{ganttchart}[y unit title=0.4cm,
          y unit chart=0.5cm,
          vgrid,hgrid,
          title label anchor/.style={below=-1.6ex},
          title left shift=.05,
          title right shift=-.05,
          title height=1,
          progress label text={},
          bar height=0.7,
          group right shift=0,
          group top shift=.6,
          group height=.3]{1}{31}
        %labels
        \gantttitle{April}{31} \\
        \gantttitle{W1}{4}
        \gantttitle{W2}{7}
        \gantttitle{W3}{7}
        \gantttitle{W4}{7}
        \gantttitle{W5}{6} \\
        %tasks
        \ganttbar[progress=0]{Submit Thesis}{1}{4} \\
        \ganttbar[progress=0]{Defent}{19}{31} \\

        %relations
        \ganttlink{elem0}{elem1}
      \end{ganttchart}
  \end{subfigure}
  \caption{Schedules for February, March, and April. Note the arrows indicate flow of action items. Also the shaded region in the rectangles indicate percent incomplete. That is, a completely white rectangle is a task that is complete, and a completely grey rectangle is a task that has not been started.}
  \end{figure}
#+end_src
